In [1]:
import pandas as pd

<h3>1. Creating dataframe from a dictionary</h3>

In [18]:
people = {
    "first": ['Anand','Rahul','Yugansh'],
    "last": ['Verma','Chaubey','Arora'],
    "email": ['ananda@micron.com','rchaubey@micron.com','yugansha@micron.com']
}

df = pd.DataFrame(people)
df.head()

     first     last                email
0    Anand    Verma    ananda@micron.com
1    Rahul  Chaubey  rchaubey@micron.com
2  Yugansh    Arora  yugansha@micron.com

In [19]:
people = [
    {
        "first": 'Anand',
        "last": 'Verma',
        "email": 'ananda@micron.com'
    },
    {
        "first": 'Rahul',
        "last": 'Chaubey',
        "email": 'rchaubey@micron.com'
    },
    {
        "first": 'Yugansh',
        "last": 'Arora',
        "email": 'yugansha@micron.com'
    },
]

df = pd.DataFrame(people)
df.head()

     first     last                email
0    Anand    Verma    ananda@micron.com
1    Rahul  Chaubey  rchaubey@micron.com
2  Yugansh    Arora  yugansha@micron.com

<h3>2. Series in Pandas</h3>
Series is a single column of rows or simply a 1-D array

In [24]:
type(df['first'])

pandas.core.series.Series

In [25]:
# example of a series
df['first']

0      Anand
1      Rahul
2    Yugansh
Name: first, dtype: object

<h3>3. Accessing columns of a dataframe</h3>

In [26]:
df['email']

0      ananda@micron.com
1    rchaubey@micron.com
2    yugansha@micron.com
Name: email, dtype: object

In [29]:
df.email

0      ananda@micron.com
1    rchaubey@micron.com
2    yugansha@micron.com
Name: email, dtype: object

In [27]:
# Select multiple columns
df[['first','email']]

     first                email
0    Anand    ananda@micron.com
1    Rahul  rchaubey@micron.com
2  Yugansh  yugansha@micron.com

In [28]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

<h3>4. iloc and loc</h3>
<b>iloc</b> is used to deal with dataframe using integer indexing 
and <b>loc</b> is used to deal with dataframe using label indexing

In [35]:
# Get the second row of the dataframe
df.iloc[1]

first                  Rahul
last                 Chaubey
email    rchaubey@micron.com
Name: 1, dtype: object

In [36]:
type(df.iloc[1])

pandas.core.series.Series

In [41]:
# Get the lastname of first two rows
df.iloc[[0,1],1]

0      Verma
1    Chaubey
Name: last, dtype: object

In [44]:
# Get the lastname and email of first and third rows
df.iloc[[0,2],[1,2]]

    last                email
0  Verma    ananda@micron.com
2  Arora  yugansha@micron.com

In [47]:
# for rows we used integers since those were the indexes
df.loc[[0,1],['first','email']]

   first                email
0  Anand    ananda@micron.com
1  Rahul  rchaubey@micron.com